content/agentd/diagram.mmd
C4Container
    Person(phone, "Phone")
    Person(user, "User")

    System_Boundary(auth_system, "Agent") {
        Container(agentd_app, "wazo-agentd", "Python", "Agent service")
        Container(auth, "wazo-auth", "Python", "Authentication service")
        ContainerDb(pgsql, "PostgreSQL", "C", "Database")
        Container(bus, "RabbitMQ", "Erlang", "Message bus")
        Container(agid, "wazo-agid", "Python", "AGI service")
        Container(asterisk, "Asterisk", "C", "Media server")
    }

    Rel(user, agentd_app, " ", "REST")
    Rel(phone, asterisk, " ", "SIP/SCCP")

    Rel(agentd_app, auth, " ", "REST")
    Rel(agentd_app, pgsql, " ", "SQL")
    Rel(agentd_app, bus, " ", "AMQP")

    Rel(agid, agentd_app, " ", "REST")

    Rel(asterisk, agid, " ", "AGI")
    Rel(agentd_app, asterisk, " ", "AMI")
